{"id": "1", "issue": "Water leaking from the front door area during wash cycle", "solution": "Inspect and clean the door gasket for debris or damage, ensure door fully closes, check inlet and drain hose connections, and avoid over‑detergenting. If gasket is torn, replace it."}
{"id": "2", "issue": "Washer shows 4C/4E water supply error at start", "solution": "Open water tap fully, straighten supply hoses, clean inlet filters, verify hot/cold hoses are on correct ports, and ensure adequate household water pressure."}
{"id": "3", "issue": "Washer shows 5C/5E drain error and water remains in drum", "solution": "Clean the debris (pump) filter, check for a kinked or clogged drain hose, verify correct drain hose height, and clear blockages in standpipe or sink."}
{"id": "4", "issue": "Machine does not spin; clothes come out soaking wet", "solution": "Rebalance the load, remove heavy single items or mixed loads that cause imbalance, clean debris filter, and run Calibration mode after fixing drainage."}
{"id": "5", "issue": "Excessive vibration and loud noise during spin", "solution": "Level the washer using adjustable feet, tighten lock nuts, ensure shipping bolts were removed, and avoid overloading or underloading the drum."}
{"id": "6", "issue": "Detergent suds overflow or SUD/Sd code appears", "solution": "Use HE detergent, reduce quantity, run an empty rinse+spin to clear suds, and clean the detergent drawer."}
{"id": "7", "issue": "Door won’t unlock after cycle ends", "solution": "Wait a few minutes for door lock to release, ensure water has drained, run drain/spin if needed, and power cycle the washer; avoid forcing the door."}
{"id": "8", "issue": "Bad odor or mildew smell from drum", "solution": "Run a Drum Clean (Self Clean) cycle with washer cleaner, wipe and dry the gasket, leave door and drawer open between washes, and use proper detergent amounts."}
{"id": "9", "issue": "Washer won’t start; no response to Start/Pause", "solution": "Verify power outlet and breaker, ensure door is fully closed, disable Child Lock, and check that cycle and options are valid for the load."}
{"id": "10", "issue": "Unbalanced load error UE/Ub mid‑spin", "solution": "Redistribute laundry evenly, avoid single heavy items, add or remove items to balance, and confirm washer is level on a solid floor."}
{"id": "11", "issue": "Water fill is very slow", "solution": "Open supply valves, clean mesh filters at hose inlets, straighten hoses, and check household water pressure and tap functionality."}
{"id": "12", "issue": "Washer stops mid‑cycle and won’t continue", "solution": "Check for error codes, ensure drainage is not blocked, confirm stable power, and restart the cycle after resolving the cause."}
{"id": "13", "issue": "Washer overfills or water level seems too high", "solution": "Inspect and clean inlet valves and pressure hose for clogs, ensure correct cycle and detergent use, and power cycle to reset controls."}
{"id": "14", "issue": "Rattling or metallic noise during wash", "solution": "Check drum for foreign objects (coins, clips), inspect drain pump filter, and empty pockets before washing."}
{"id": "15", "issue": "Error dE/door error displayed", "solution": "Ensure door is firmly closed, clean latch area, do not overload, and restart the cycle. Inspect door lock if error persists."}
{"id": "16", "issue": "Water leaking from back of machine", "solution": "Tighten and reseat inlet hoses, replace damaged hoses or washers, and verify drain hose is inserted and secured to prevent backflow."}
{"id": "17", "issue": "Washer pauses frequently to rebalance", "solution": "Avoid mixed heavy/light items, distribute laundry evenly, reduce load size, and make sure the machine is level."}
{"id": "18", "issue": "Cycle times are unusually long", "solution": "Reduce detergent to prevent excess suds, ensure proper water temperature and pressure, and confirm load is balanced to avoid extra spin attempts."}
{"id": "19", "issue": "Clothes come out still soapy after rinse", "solution": "Use less detergent, clean detergent drawer, run an extra rinse, and confirm adequate water pressure and inlet filter cleanliness."}
{"id": "20", "issue": "Washer displays tE/temperature sensor related error", "solution": "Power cycle the washer, verify water supply connections, and run a different cycle; if error persists, service may be required."}
{"id": "21", "issue": "LE/LE1 leak‑related message or water detected in base", "solution": "Check all hose joints for drips, inspect door gasket and detergent drawer for leaks, reduce detergent, and ensure drain hose is properly installed."}
{"id": "22", "issue": "3E/motor related error during spin", "solution": "Remove load, check for overloading or severe imbalance, power cycle, and attempt a small test load; contact service if error recurs."}
{"id": "23", "issue": "Drum does not tumble in wash phase", "solution": "Verify door lock engaged, reduce heavy loads, and restart cycle. If no movement across cycles, service may be needed."}
{"id": "24", "issue": "Water left in detergent softener compartment", "solution": "Lift out and clean the detergent drawer and siphon cap, remove residue, and reinstall correctly to restore proper flow."}
{"id": "25", "issue": "Detergent drawer leaks water during fill", "solution": "Clean drawer and housing of buildup, avoid overfilling compartments, and check water pressure for excessive flow."}
{"id": "26", "issue": "Washer trips breaker or power intermittently cuts", "solution": "Use a dedicated grounded outlet, avoid extension cords, inspect plug, and consult an electrician if the circuit is overloaded."}
{"id": "27", "issue": "Strong vibration on wooden floor", "solution": "Place washer on a rigid surface, use anti‑vibration pads, ensure leveling feet are adjusted and locked, and reduce spin speed for heavy loads."}
{"id": "28", "issue": "Fabric softener not dispensing", "solution": "Clean softener compartment and siphon, avoid thickened or expired softener, and ensure correct water pressure during rinse."}
{"id": "29", "issue": "Washer displays Ub/UR balance code with small loads", "solution": "Add a few extra items to stabilize the drum or select a lower spin speed; very small loads can cause imbalance."}
{"id": "30", "issue": "Door gasket has mold spots", "solution": "Clean gasket with a washer cleaner, run Drum Clean, dry the seal after use, and keep door ajar between cycles."}
{"id": "31", "issue": "Washer makes grinding sound when draining", "solution": "Empty and clean the debris filter, check for coins or small objects in the pump, and inspect the drain hose for obstructions."}
{"id": "32", "issue": "Clothes tangling and wrinkling heavily", "solution": "Avoid overloading, use proper cycle for fabric type, shake out items before drying, and reduce spin speed for delicate loads."}
{"id": "33", "issue": "Washer won’t fill with hot water", "solution": "Confirm hot hose is connected to hot inlet, open hot tap, clean inlet screens, and verify water heater is functioning."}
{"id": "34", "issue": "Error for Child Lock/CL shows and controls unresponsive", "solution": "Disable Child Lock by pressing and holding the lock button combo per model instructions and then restart the cycle."}
{"id": "35", "issue": "Drum scraping sound during spin", "solution": "Ensure no foreign objects are between drum and seal, check that shipping bolts were removed, and verify machine is not overloaded."}
{"id": "36", "issue": "Water splashes out of detergent drawer", "solution": "Clean drawer and jets, reduce water pressure if extremely high, and do not pour detergent while water is filling."}
{"id": "37", "issue": "Washer shows OC/overflow or too much water detected", "solution": "Power off, check inlet valve operation, ensure pressure hose is not blocked, and reduce detergent to prevent excessive suds."}
{"id": "38", "issue": "Rust‑colored stains after wash", "solution": "Run Drum Clean, check water supply lines for corrosion, use proper detergent, and inspect the drum for foreign metal objects."}
{"id": "39", "issue": "Washer frequently adds time near cycle end", "solution": "Reduce detergent to minimize extra rinses, rebalance the load, and ensure proper drainage so the machine doesn’t retry spin cycles."}
{"id": "40", "issue": "No water drains from emergency drain tube", "solution": "Remove and clean the debris filter first, then retry draining; clear clogs in the tube and have a shallow pan ready for water."}
{"id": "41", "issue": "Error 1C/1E water level sensor issue", "solution": "Power cycle, ensure drain hose is correctly installed (not siphoning), and check for suds or overloading; service if persistent."}
{"id": "42", "issue": "Machine shakes violently in first months after purchase", "solution": "Confirm all shipping/transport bolts were removed, level the unit, and run Calibration mode with an empty drum."}
{"id": "43", "issue": "Washer smells like sewage when draining", "solution": "Clean debris filter and drain hose, flush the standpipe, run Drum Clean, and ensure a proper P‑trap is installed in the home drain."}
{"id": "44", "issue": "Clothes still have lint after wash", "solution": "Use correct cycle for fabric, avoid mixed heavy and lint‑producing loads, clean machine regularly, and check water levels and rinse options."}
{"id": "45", "issue": "Bleach compartment retains liquid", "solution": "Clean the bleach channel and drawer, avoid thick gel products, and run a rinse cycle to flush residual chemicals."}
{"id": "46", "issue": "Spin speed cannot be selected for chosen cycle", "solution": "Some cycles lock spin speed for fabric care; pick a different cycle or options set that permits spin adjustments."}
{"id": "47", "issue": "Water leaks only during rinse phase", "solution": "Inspect detergent drawer for buildup that diverts water, check door gasket, and verify drain hose placement to prevent backflow."}
{"id": "48", "issue": "Washer repeatedly displays HE/hot water related notice on cold wash", "solution": "Ensure both hot and cold hoses are connected correctly; some cold cycles still mix in hot water for performance."}
{"id": "49", "issue": "Eco drum clean reminder keeps appearing", "solution": "Run the Drum Clean cycle with an approved cleaner, then dry the gasket and leave the door open after use to reduce future reminders."}
{"id": "50", "issue": "End of cycle chime too loud or frequent", "solution": "Adjust or mute the sound setting in Options per model manual, or use the SmartThings app if supported to change notification sounds."}
