{"id": 1, "product": "samsung-fridge", "issue": "Not cooling (fridge compartment)", "solution": "Check power and outlet; make sure doors are fully closed and seals are clean; check temperature settings; clean condenser coils; defrost if heavy frost; if still not cooling, run Samsung diagnostic or contact service."}
{"id": 2, "product": "samsung-fridge", "issue": "Freezer not freezing / freezer warm", "solution": "Verify temperature settings, avoid overfilling, check for blocked vents, ensure door seals are intact, clean condenser coils, run self-diagnostic and check error codes; call service if compressor fault suspected."}
{"id": 3, "product": "samsung-fridge", "issue": "Water leaking inside fridge or from bottom", "solution": "Inspect and clear defrost drain (unclog any ice/debris); check for blocked drain tube; ensure proper leveling; verify water line and filter connections; run manual drain clearing steps per Samsung guide."}
{"id": 4, "product": "samsung-fridge", "issue": "Water dispenser dripping", "solution": "Air in water line after filter change can cause dripping—flush system; check water line connector and filter seating; replace worn inlet valve or check water pressure."}
{"id": 5, "product": "samsung-fridge", "issue": "Ice maker not making ice", "solution": "Confirm ice maker is turned on; check water supply and filter; inspect fill tube for ice blockage; run ice maker reset cycle or force fill; replace faulty water inlet valve if necessary."}
{"id": 6, "product": "samsung-fridge", "issue": "Ice maker overfilling or ice maker keeps running", "solution": "Check ice bucket position and sensor/arm; inspect fill valve for overfilling; clear ice bridge; replace faulty water valve or sensor if needed."}
{"id": 7, "product": "samsung-fridge", "issue": "Excessive frost or ice buildup in freezer", "solution": "Check door seal and closure; avoid storing hot/warm items; defrost freezer and clear drain; inspect defrost heater and thermostat; run diagnostics for defrost failure."}
{"id": 8, "product": "samsung-fridge", "issue": "Fridge making loud or unusual noises", "solution": "Verify fridge is level; check for items touching the compressor or fan; inspect evaporator/condenser fans for obstruction; clean condenser and ensure proper airflow."}
{"id": 9, "product": "samsung-fridge", "issue": "Temperature fluctuates frequently", "solution": "Avoid frequent door openings; check door seals; ensure vents aren't blocked; confirm correct temperature settings; clean condenser and verify adequate clearance around unit."}
{"id": 10, "product": "samsung-fridge", "issue": "Door not sealing / gasket damaged", "solution": "Inspect gasket for cracks or debris; clean gasket surfaces; if damaged, replace gasket; adjust door hinges and leveling to ensure full closure."}
{"id": 11, "product": "samsung-fridge", "issue": "Fridge displays error codes or beeps", "solution": "Check Samsung support error-code guide for model-specific codes; run built-in diagnostic; note displayed code and follow Samsung troubleshooting steps or book service if indicated."}
{"id": 12, "product": "samsung-fridge", "issue": "Water filter causing low flow or tastes odd", "solution": "Replace water filter per manufacturer schedule; flush new filter per instructions; check water pressure and connectors."}
{"id": 13, "product": "samsung-fridge", "issue": "Door alarm beeping continuously", "solution": "Ensure door fully closed and gasket clean; check for obstructions; reset alarm from control panel; if persistent, inspect door switch."}
{"id": 14, "product": "samsung-fridge", "issue": "Fridge lights not working", "solution": "Check bulb and replace if needed; verify door switch operation and control board; consult manual for LED panel issues."}
{"id": 15, "product": "samsung-fridge", "issue": "Foul odour inside fridge", "solution": "Discard spoiled food, clean interior with baking-soda solution, remove and clean drawers, check and replace water filter if necessary; keep an open box of baking soda or activated charcoal to absorb smells."}
{"id": 16, "product": "samsung-fridge", "issue": "Ice or water dispenser not dispensing", "solution": "Check water supply line and valve; ensure filter not clogged; check dispenser actuator and wiring; run diagnostics and replace faulty inlet valve."}
{"id": 17, "product": "samsung-fridge", "issue": "Compressor runs constantly", "solution": "Check ambient temperature and ventilation; ensure condenser coils are clean; check door seals and frequent openings; if compressor overheats or runs abnormally, schedule service."}
{"id": 18, "product": "samsung-fridge", "issue": "Fridge vibrates or shakes", "solution": "Level the unit, move fridge slightly away from wall to prevent contact, check for loose components or items touching fans, and inspect mounting of condenser/compressor."}
{"id": 19, "product": "samsung-fridge", "issue": "Smart/Family Hub connectivity issues", "solution": "Restart the hub, check Wi‑Fi and network settings, update firmware/software from Samsung support, and reset network settings if necessary."}
{"id": 20, "product": "samsung-fridge", "issue": "Door ice/water buildup or frost in compartments", "solution": "Check door seals and vents, avoid storing uncovered liquids, ensure correct humidity settings, defrost if needed, and check defrost drain for clogs."}
